In [1]:
import numpy as np
import pandas as pd

In [2]:
obj=pd.Series([1,2,34,5])
obj

0     1
1     2
2    34
3     5
dtype: int64

In [4]:
obj.get(3)

5

In [5]:
obj.values

array([ 1,  2, 34,  5], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj1=pd.Series([1,2,3,4],index=['name','rollmo',1,'school'])

In [8]:
obj1

name      1
rollmo    2
1         3
school    4
dtype: int64

In [9]:
obj1['name']

1

In [12]:
obj1[['name','school']]

name      1
school    4
dtype: int64

In [14]:
obj1[obj1>1]

rollmo    2
1         3
school    4
dtype: int64

In [15]:
obj1 *2

name      2
rollmo    4
1         6
school    8
dtype: int64

In [19]:
'b' in obj1

False

In [20]:
'name' in obj1

True

In [24]:
obj2={'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3=pd.Series(obj2)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [26]:
states=['California','Ohio','Utah']
obj4=pd.Series(obj2,index=states)
obj4

California        NaN
Ohio          35000.0
Utah           5000.0
dtype: float64

In [27]:
pd.isnull(obj4)

California     True
Ohio          False
Utah          False
dtype: bool

In [28]:
pd.notnull(obj4)

California    False
Ohio           True
Utah           True
dtype: bool

In [29]:
obj4.isnull()

California     True
Ohio          False
Utah          False
dtype: bool

In [30]:
obj3+obj4

California        NaN
Ohio          70000.0
Oregon            NaN
Texas             NaN
Utah          10000.0
dtype: float64

In [32]:
obj4.index.name='state'
obj4

state
California        NaN
Ohio          35000.0
Utah           5000.0
dtype: float64

In [33]:
obj4.name='populatui'
obj4

state
California        NaN
Ohio          35000.0
Utah           5000.0
Name: populatui, dtype: float64

In [34]:
obj4.index=['1','2','3']
obj4

1        NaN
2    35000.0
3     5000.0
Name: populatui, dtype: float64

In [16]:
data1={'name':['diya','hhg','tunna','abhi','nonu','monu','ponu'],'age':[12,13,14,15,16,17,18]}
data=pd.DataFrame(data1)
data

    name  age
0   diya   12
1    hhg   13
2  tunna   14
3   abhi   15
4   nonu   16
5   monu   17
6   ponu   18

In [56]:
data.head()

    name  age
0   diya   12
1    hhg   13
2  tunna   14
3   abhi   15
4   nonu   16

In [57]:
data.tail()

    name  age
2  tunna   14
3   abhi   15
4   nonu   16
5   monu   17
6   ponu   18

In [17]:
data2=pd.DataFrame(data1,columns=['age','name','roolno'],index=['one','two','three','four','five','six','seven'])
data2

       age   name roolno
one     12   diya    NaN
two     13    hhg    NaN
three   14  tunna    NaN
four    15   abhi    NaN
five    16   nonu    NaN
six     17   monu    NaN
seven   18   ponu    NaN

In [65]:
data2.columns

Index(['age', 'name', 'roolno'], dtype='object')

In [61]:
data2['age']

one      12
two      13
three    14
four     15
five     16
six      17
seven    18
Name: age, dtype: int64

In [62]:
data2.age

one      12
two      13
three    14
four     15
five     16
six      17
seven    18
Name: age, dtype: int64

In [63]:
data2.loc['one']

age       12
name    diya
Name: one, dtype: object

In [66]:
data2['roolno']=5
data2

       age   name  roolno
one     12   diya       5
two     13    hhg       5
three   14  tunna       5
four    15   abhi       5
five    16   nonu       5
six     17   monu       5
seven   18   ponu       5

In [44]:
data2['roolno']=np.arange(0,7)
data2

       age   name  roolno
one     12   diya       0
two     13    hhg       1
three   14  tunna       2
four    15   abhi       3
five    16   nonu       4
six     17   monu       5
seven   18   ponu       6

In [68]:
data2['roolno']=[2,3,5,1,2,2,2]
data2

       age   name  roolno
one     12   diya       2
two     13    hhg       3
three   14  tunna       5
four    15   abhi       1
five    16   nonu       2
six     17   monu       2
seven   18   ponu       2

In [72]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
data2['debt'] = val
val

two      -1.2
four     -1.5
five     -1.7
eight    12.0
dtype: float64

In [73]:
data2

       age   name  roolno  debt
one     12   diya       2   NaN
two     13    hhg       3  -1.2
three   14  tunna       5   NaN
four    15   abhi       1  -1.5
five    16   nonu       2  -1.7
six     17   monu       2   NaN
seven   18   ponu       2   NaN

In [75]:
data2['phoneno']=5

In [76]:
data2

       age   name  roolno  debt  phoneno
one     12   diya       2   NaN        5
two     13    hhg       3  -1.2        5
three   14  tunna       5   NaN        5
four    15   abhi       1  -1.5        5
five    16   nonu       2  -1.7        5
six     17   monu       2   NaN        5
seven   18   ponu       2   NaN        5

##

In [81]:
data2['school']=data2.name=='diya'
data2

       age  name  roolno  debt phoneno  school
one     12  diya       2   NaN    diya    True
two     13  diya       3  -1.2    diya    True
three   14  diya       5   NaN    diya    True
four    15  diya       1  -1.5    diya    True
five    16  diya       2  -1.7    diya    True
six     17  diya       2   NaN    diya    True
seven   18  diya       2   NaN    diya    True

In [82]:
del data2['school']
data2

       age  name  roolno  debt phoneno
one     12  diya       2   NaN    diya
two     13  diya       3  -1.2    diya
three   14  diya       5   NaN    diya
four    15  diya       1  -1.5    diya
five    16  diya       2  -1.7    diya
six     17  diya       2   NaN    diya
seven   18  diya       2   NaN    diya

In [87]:
data5={'name':{'broter':'abhi','sister':'diya'},'age':{'bb':15,'cc':16}}
data6=pd.DataFrame(data5)
data6

        name   age
broter  abhi   NaN
sister  diya   NaN
bb       NaN  15.0
cc       NaN  16.0

In [88]:
data6.T

     broter sister   bb   cc
name   abhi   diya  NaN  NaN
age     NaN    NaN   15   16

In [2]:
obj5=pd.Series([1,2,3],index=['a','b','c'])
obj5

a    1
b    2
c    3
dtype: int64

In [6]:
a=obj5.index
a

Index(['a', 'b', 'c'], dtype='object')

In [7]:
a[1:]

Index(['b', 'c'], dtype='object')

In [8]:
a[1]='d'

TypeError: Index does not support mutable operations

In [12]:
labels=pd.Index(np.arange(5))

In [13]:
obj6=pd.Series(np.arange(5),index=labels)
obj6

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [14]:
obj6.index is labels

True

In [18]:
data2.columns

Index(['age', 'name', 'roolno'], dtype='object')

In [19]:
'age' in data2.columns

True

In [20]:
'age' in data2.index

False

In [21]:
data2

       age   name roolno
one     12   diya    NaN
two     13    hhg    NaN
three   14  tunna    NaN
four    15   abhi    NaN
five    16   nonu    NaN
six     17   monu    NaN
seven   18   ponu    NaN

In [22]:
'seven' in data2.index

True

In [23]:
labels=pd.Index([0,0])

In [24]:
a=pd.Series([1,2],index=labels)

In [25]:
a

0    1
0    2
dtype: int64

In [26]:
a[0]

0    1
0    2
dtype: int64

In [27]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [28]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [29]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [30]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [31]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [32]:
obj4=obj3.reindex(np.arange(6))
obj4

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [34]:
obj4=obj3.reindex(np.arange(6),method='ffill')
obj4

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [35]:
a=pd.DataFrame(np.arange(0,9).reshape(3,3),index=['a','b','c'],columns=['e','f','g'])
a

   e  f  g
a  0  1  2
b  3  4  5
c  6  7  8

In [36]:
b=a.reindex(['h','i','j'])

In [37]:
b

    e   f   g
h NaN NaN NaN
i NaN NaN NaN
j NaN NaN NaN

In [38]:
c=a.reindex(columns=['z','x','y'])
c

    z   x   y
a NaN NaN NaN
b NaN NaN NaN
c NaN NaN NaN

In [42]:
states=['z','x']
a.loc[['a','b'],states]

KeyError: "None of [Index(['z', 'x'], dtype='object')] are in the [columns]"

In [45]:
 obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [47]:
obj2=obj.drop('c')
obj2

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [48]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [49]:
 data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [50]:
data.drop('Ohio')

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [51]:
data.drop('one',axis=1)

          two  three  four
Ohio        1      2     3
Colorado    5      6     7
Utah        9     10    11
New York   13     14    15

In [52]:
obj.drop('a',inplace=True)
obj

b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [53]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [54]:
obj['b']

1.0

In [55]:
obj[0]

0.0

In [56]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [61]:
obj[['b','a']]

b    1.0
a    0.0
dtype: float64

In [62]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [63]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [64]:
obj['b':'d']=5
obj

a    0.0
b    5.0
c    5.0
d    5.0
dtype: float64

In [65]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])

In [66]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [67]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [68]:
data[['two','one']]

          two  one
Ohio        1    0
Colorado    5    4
Utah        9    8
New York   13   12

In [70]:
data[0:1]

      one  two  three  four
Ohio    0    1      2     3

In [71]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [73]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [74]:
data.iloc[1,[1,2]]

two      5
three    6
Name: Colorado, dtype: int32

In [75]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [77]:
data.loc[:'Utah',:]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11

In [78]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [81]:
data.iloc[:,:3][data.three>5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14